esp-cpp/espp/components/serial_plotter/example/sdkconfig.defaults
# This example uses the native USB-OTG peripheral (vendor / WebUSB), which is
# only available on the ESP32-S3 (also S2 / P4) -- NOT the classic ESP32. Pin the
# target here so a bare `idf.py build` does not fall back to esp32.
CONFIG_IDF_TARGET="esp32s3"

# Common ESP-related
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Enable the TinyUSB vendor-specific class (THE key enablement for the vendor /
# WebUSB interface). esp_tinyusb gates CFG_TUD_VENDOR behind
# CONFIG_TINYUSB_VENDOR_COUNT; setting it > 0 compiles in the vendor class
# driver so espp::UsbDevice's vendor function (bInterfaceClass 0xFF + WebUSB)
# works. The telemetry web app plots over this WebUSB interface.
CONFIG_TINYUSB_VENDOR_COUNT=1

# CDC + HID are enabled only to keep the usb_device component compiling (it
# includes the TinyUSB CDC/HID headers unconditionally). This example creates
# NO CDC or HID interface -- it exposes the vendor (WebUSB) interface only, so
# the device enumerates with just that one telemetry interface.
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_HID_COUNT=1

# Telemetry frames are small (a SAMPLE is a 4-byte timestamp + 4 bytes/channel),
# but give the vendor TX FIFO headroom so a burst of batched samples is never
# truncated by TinyUSB backpressure. The vendor RX FIFO only carries short
# requests (GET_SCHEMA / SET_STREAM), so 512 bytes is plenty there.
CONFIG_TINYUSB_VENDOR_RX_BUFSIZE=512
CONFIG_TINYUSB_VENDOR_TX_BUFSIZE=4096

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
